pengnianchun/Fangyan-dspic30f6012A-299/东风超龙-湖北十堰/20170517-1T2/DongFengChaoLong-PIC299-HuBeiShiYan/src/SYSTEM.h
#define R_PO1  gCTL[4].bit1
#define R_PO2  gCTL[4].bit2
#define R_PO3  gCTL[4].bit3
#define R_PO4  gCTL[4].bit4
#define R_PO5  gCTL[4].bit5
#define R_PO6  gCTL[4].bit6
#define R_PO7  gCTL[4].bit7
#define R_PO8  gCTL[4].bit8 
#define R_PO9   gCTL[5].bit1
#define R_PO10  gCTL[5].bit2
#define R_PO11  gCTL[5].bit3
#define R_PO12  gCTL[5].bit4
#define R_PO13  gCTL[5].bit5
#define R_PO14  gCTL[5].bit6
#define R_PO15  gCTL[5].bit7
#define R_PO16  gCTL[5].bit8  /////

extern DBCM_KEY fKEY; //前模块功率开关状态
#define fKL1    fKEY.BITS.kl1
#define fKL2    fKEY.BITS.kl2
#define fKL3    fKEY.BITS.kl3
#define fKL4    fKEY.BITS.kl4
#define fKL5    fKEY.BITS.kl5
#define fKL6    fKEY.BITS.kl6
#define fKL7    fKEY.BITS.kl7
#define fKL8    fKEY.BITS.kl8
#define fKL9    fKEY.BITS.kl9
#define fKL10   fKEY.BITS.kl10
#define fKL11   fKEY.BITS.kl11
#define fKL12   fKEY.BITS.kl12
#define fKL13   fKEY.BITS.kl13
#define fKL14   fKEY.BITS.kl14
#define fKL15   fKEY.BITS.kl15
#define fKH1    fKEY.BITS.kh1
#define fADD    fKEY.BITS.add

extern DBCM_KEY mKEY; //中（顶）模块功率开关状态
#define mKL1    mKEY.BITS.kl1
#define mKL2    mKEY.BITS.kl2
#define mKL3    mKEY.BITS.kl3
#define mKL4    mKEY.BITS.kl4
#define mKL5    mKEY.BITS.kl5
#define mKL6    mKEY.BITS.kl6
#define mKL7    mKEY.BITS.kl7
#define mKL8    mKEY.BITS.kl8
#define mKL9    mKEY.BITS.kl9
#define mKL10   mKEY.BITS.kl10
#define mKL11   mKEY.BITS.kl11
#define mKL12   mKEY.BITS.kl12
#define mKL13   mKEY.BITS.kl13
#define mKL14   mKEY.BITS.kl14
#define mKL15   mKEY.BITS.kl15
#define mKH1    mKEY.BITS.kh1
#define mADD    mKEY.BITS.add

extern DBCM_KEY rKEY; //后模块功率开关状态
#define rKL1    rKEY.BITS.kl1
#define rKL2    rKEY.BITS.kl2
#define rKL3    rKEY.BITS.kl3
#define rKL4    rKEY.BITS.kl4
#define rKL5    rKEY.BITS.kl5
#define rKL6    rKEY.BITS.kl6
#define rKL7    rKEY.BITS.kl7
#define rKL8    rKEY.BITS.kl8
#define rKL9    rKEY.BITS.kl9
#define rKL10   rKEY.BITS.kl10
#define rKL11   rKEY.BITS.kl11
#define rKL12   rKEY.BITS.kl12
#define rKL13   rKEY.BITS.kl13
#define rKL14   rKEY.BITS.kl14
#define rKL15   rKEY.BITS.kl15
#define rKH1    rKEY.BITS.kh1
#define rADD    rKEY.BITS.add

#define CAN_TIME 30//CAN节点故障报警
#define BAT24_TIME 100//蓄电池电压过低报警10秒

extern unsigned int fFreq; //前模块频率
extern unsigned int mFreq; //中（顶）模块频率
extern unsigned int rFreq; //后模块频率
extern unsigned int fSpeed; //前模块折算车速
extern unsigned int mSpeed; //中（顶）模块折算车速
extern unsigned int rSpeed; //后模块折算车速
extern unsigned int fADR[2]; //前模块电阻值
extern unsigned int mADR[2]; //中（顶）模块电阻值
extern unsigned int rADR[2]; //后模块电阻值
extern DBCM_POUT fPOUT; //前模块功率输出状态
extern DBCM_POUT mPOUT; //中（顶）模块功率输出状态
extern DBCM_POUT rPOUT; //后模块功率输出状态
extern unsigned char fPF[16]; //前模块功率输出故障
extern unsigned char mPF[16]; //中（顶）模块功率故障
extern unsigned char rPF[16]; //后模块功率输出故障
extern unsigned int fpcur[15];//前模块功率输出电流
extern unsigned int mpcur[15];//中模块功率输出电流
extern unsigned int rpcur[15];//后模块功率输出电流

extern unsigned int ADR[8]; //模拟量采集   10/15
extern unsigned int ADV[8]; //模拟量采集 

extern unsigned int pSpeed; //外部CAN换算车速
//extern const unsigned char BMP_LOGO[];
//extern const unsigned char BMP_LOGObmp[];

/*************************************/
//电机
extern unsigned char DMC_Status;//电机控制器基本状态
extern unsigned char DMC_Level;//电机控制器故障级别
extern unsigned char DMC_Life;//电机生命
extern unsigned int  DMC_Torque;//电机转矩
extern unsigned int  DMC_Rpm;//电机转速
extern unsigned char DMC_Speed;//车速
extern unsigned char DMC_Gear;//档位

extern unsigned int  DMC_Voltage;//电机控制器母线电压
extern unsigned int  DMC_Current;//电机控制器母线电流
extern unsigned char DMC_Controller_temp;//电机控制器温度
extern unsigned char DMC_Moto_temp;//电机温度
extern unsigned char DMC_Protect_code;//电机控制器保护代码
extern unsigned char DMC_Verison;//电机控制器版本号

extern unsigned char DMC_Accelerator_percent;//油门踏板开度
extern unsigned char DMC_Brake_percent;//制动踏板开度
extern unsigned char DMC_Charge;//充放电状态
extern unsigned char DMC_GB_Gear; //国标档位

//气泵控制器
extern unsigned int  DMQ_Rpm;//气泵控制器电机转速
extern unsigned int  DMQ_Voltage;//气泵控制器母线电压
extern unsigned char DMQ_Current;//气泵控制器电机母线电流
extern unsigned char DMQ_temp; //气泵温度
extern unsigned char DMQ_Controller_temp;//气泵控制器温度
extern unsigned char DMQ_Life;//气泵控制器生命
extern unsigned char DMQ_Status;//气泵控制器基本状态

//DCDC
extern unsigned char DCDC_Status;//DCDC基本状态
extern unsigned char DCDC_Temp;//DCDC模块温度
extern unsigned int  DCDC_Voltage;//DCDC输出电压
extern unsigned int  DCDC_Current;//DCDC输出电流
extern unsigned char DCDC_Code;//DCDC故障代码
extern unsigned char DCDC_Verison;//DCDC版本号

//油泵控制器
extern unsigned int  DMY_Rpm;//油泵控制器电机转速
extern unsigned int  DMY_Voltage;//油泵控制器母线电压
extern unsigned char DMY_Current;//油泵控制器电机母线电流
extern unsigned char DMY_Controller_temp;//油泵控制器温度
extern unsigned char DMY_Life;//油泵控制器生命
extern unsigned char DMY_Status;//油泵控制器基本状态

//空调
extern unsigned char Air_Status_Flag1; //空调状态1
extern unsigned char Air_Status_Flag2; //空调状态2
extern unsigned char Air_Status_Flag3; //空调状态3
extern unsigned char Air_Indoor_t; //室内温度
extern unsigned char Air_Outdoor_t; //室外温度
extern unsigned char Air_Set_t; //设定

//BMS
extern unsigned char BMS_Type;//BMS参数类型
extern unsigned char Battery_Case_Total_Number;//电池箱体个数
extern unsigned char BMS_Unit_Number;//电池管理系统从控单元个数
extern unsigned int  Battery_Cell_Total_Number;//电池总串数
extern unsigned int  BMS_Nubmer;//电池管理系统编号

extern unsigned char Battery_Case_number;//电池箱号n
extern unsigned char Battery_Cell_number;//电池箱n内电池串数
extern unsigned char Battery_Cell_Temp_Number;//电池箱内电池温度探头个数

extern unsigned int  BMS_V;//电池总电压
extern unsigned int  BMS_A;//电池总电流
extern unsigned char BMS_SOC;//电池SOC
extern unsigned char BMS_Life;//BMS LIFE
extern unsigned char BMS_Status_Flag1;//电池状态1
extern unsigned char BMS_Status_Flag2;//电池状态2

extern unsigned int  Battery_Single_H; //电池单体高电压
extern unsigned int  Battery_Single_L; //电池单体低电压
extern unsigned char Battery_Temp_H; //电池单体最高温度
extern unsigned char Battery_Temp_L; //电池单体最低温度
extern unsigned char BMS_Status_Flag3;//电池状态3
extern unsigned char BMS_Status_Flag4;//继电器状态

extern unsigned char Battery_Single_H_Positon_Case; //电池单体高电压箱号
extern unsigned char Battery_Single_H_Positon_Cell; //电池单体高电压位置
extern unsigned char Battery_Single_L_Positon_Case; //电池单体低电压箱号
extern unsigned char Battery_Single_L_Positon_Cell; //电池单体低电压位置
extern unsigned char Battery_Temp_H_Positon_Case; //电池单体高温度箱号
extern unsigned char Battery_Temp_H_Positon_Cell; //电池单体高温度位置
extern unsigned char Battery_Temp_L_Positon_Case; //电池单体低温度箱号
extern unsigned char Battery_Temp_L_Positon_Cell; //电池单体低温度位置

extern unsigned char BMU_Comm_Status1;//1-8   BMU通讯状态
extern unsigned char BMU_Comm_Status2;//9-16  BMU通讯状态
extern unsigned char BMU_Comm_Status3;//17-24 BMU通讯状态
extern unsigned char BMU_Comm_Status4; //25-32 BMU通讯状态

extern unsigned char BMU_Bala_Status1; //1-8   BMU均衡状态
extern unsigned char BMU_Bala_Status2; //9-16  BMU均衡状态
extern unsigned char BMU_Bala_Status3; //17-24 BMU均衡状态
extern unsigned char BMU_Bala_Status4; //25-32 BMU均衡状态

