pengnianchun/Fangyan-dspic30f6012A-299/东风超龙-湖北十堰/20170517-1T2/DongFengChaoLong-PIC299-HuBeiShiYan/src/SYSTEM.h
extern unsigned char water_level;//水位

extern unsigned char Wait_start;//等待启动
extern unsigned char Maintain_warn;//维护报警
extern unsigned char Stop_warn;//停机报警
extern unsigned char Engine_warn;//发动机故障
*/


typedef union {
 struct {
 unsigned int  boxid;//箱体号
 unsigned int  vol;   //电池电压
 };
 unsigned char byte[4];
}DC_DATA; 

typedef union {
 struct {
  unsigned char  ID;//箱体号
  unsigned char  TEMP;   //电池电压
 };
 unsigned char byte[2];
}DC_TEMP;


/******************************************************************/
 #define  BAT_NUM      96  //单体电池个数
 #define  CAN_BAT_NUM  24   //单体电池电压CAN发送数据帧数，
 #define  BAT_BOX_NUM  10               //一帧包含四个单体电压，不足四个按四个计算      

//整车控制器变量 
extern unsigned int  DJcontroler_voltage;//电机控制器输入电压
extern unsigned int  DJcontroler_current; //电机控制器入电流高
extern unsigned int  DJ_speed;
extern unsigned char DJ_temperature;             //驱动电机温度
extern unsigned char DJcontroler_temperature;    //驱动电机控制器温度

extern unsigned char DJ_temperature1;         //电机温度
extern unsigned char DJcontroler_temperature1;//电机控制器温度
extern unsigned char VCU_Status[10];     //VCU状态
extern unsigned char Gear;               //档位
extern unsigned int  XHLC;               //续航里程
extern unsigned char DJ_version;         //MCU 软件版本信息
extern unsigned char DJ_Status[10];      //电机控制系统状态
extern unsigned char DJ_fault;           //MCU 系统故障代码
extern unsigned int  DJ_Power;           //电机实时输出功

extern unsigned int  DJtorque;            //电机输出目标转矩
extern unsigned char system_state;        //系统工作状态
extern unsigned int  system_fault;        //系统故障码
extern unsigned char fault_grade;        //故障等级
extern unsigned long version;            //程序版本号高 3字节
extern unsigned char controler_LIFE; //整车控制器Life
  
extern unsigned char KZQversion[7];
extern unsigned char DJversion[7]; 

extern unsigned char PDX_state[2]; 
extern unsigned char DCDC1_temp;
extern unsigned char DCDC1_fault;
extern unsigned char DCDC2_temp;
extern unsigned char DCDC2_fault;
extern unsigned char DCDC3_temp;
extern unsigned char DCDC3_fault;

extern unsigned char KEY_state[4];  //开关量状态  //档位
extern unsigned int  traction_st[2];   //加速踏板百分比
extern unsigned char brake_st[2];      //制动踏板百分比

extern unsigned int  anode_R;     //正端对地绝缘电阻
extern unsigned int  negative_R;  //负端对地绝缘电阻
extern unsigned char eror_R;      //绝缘故障等级
extern unsigned char R_state[3];  //

extern unsigned char SX_state;
extern unsigned char SX_fault;

extern unsigned int  SX_DCvoltage;
extern unsigned int  SX_DRvoltage;
extern unsigned int  SX_DCcurrent;
extern unsigned int  SX_DRcurrent;

extern unsigned char KT_Status[2];
extern unsigned char KT_temp[3];
extern unsigned long KT_current;
extern unsigned char KT_life;

extern unsigned int  CDJ_SRvoltage;
extern unsigned int  CDJ_SRcurrent;
extern unsigned int  CDJ_SCvoltage;
extern unsigned int  CDJ_SCcurrent;

extern unsigned int  CDJ_power;
extern unsigned char CDJ_temp;
extern unsigned char CDJ_Status;
extern unsigned char CDJ_fault;
extern unsigned char CDJ_grade;
extern unsigned char CDJ_lift;

//电池电池管理相关报文 
extern unsigned int  DC_voltage; //电池电压 
extern unsigned int  DC_current; //电池电流 
extern unsigned char DC_SOC;
extern unsigned char DC_Status[5];

extern unsigned int  CD_current; //当前最大允许充电电流
extern unsigned int  FD_current; //当前最大允许放电电流
extern unsigned char DC_fault;  //系统故障等级
extern unsigned int  Vaverage; //
extern unsigned char Tmax;     //最大单体电池温度
extern unsigned char Tmin;     //最小单体电池温度


extern unsigned char JY_life;
extern unsigned char JY_Status;
extern unsigned int  DCanode_R;     //正端对地绝缘电阻
extern unsigned int  DCnegative_R;  //负端对地绝缘电阻
extern unsigned int  Vmax;     //最大单体电压
extern unsigned int  Vmin;     //最小单体电压
 
extern unsigned char BMU_NUM;   //定义模块数量
extern unsigned int  Battery_Voltage[10][50]; //电池单体电压
extern unsigned int  Battery_Voltage_Sum[10]; //电池单体电压每箱数量
extern unsigned int  Battery_Temp_Sum[10];    //电池单体温度每箱数量
extern unsigned char DC_Temp[10][10];
extern unsigned char DC_JH_Status[10][4];//电池均衡状态 模块内  1-12 节
extern unsigned char DC_JY[10];//绝缘电阻
extern unsigned char DC_DT_sum;//单体电池个数( 串数) 
extern unsigned char DC_TEMP_sum;//单体温度个数
extern unsigned char Vmax_num[2];//最高单体电压电池位置   Vmax_num[1]//最高单体电压电池位置：单体电池编号
extern unsigned char Vmin_num[2];//最低单体电压电池位置   Vmin_num[1]//最低单体电压电池位置：单体电池编号     
extern unsigned char Tmax_num[2];//最高单体温度位置       Tmax_num[1]//最高单体温度位置：单体温度编号
extern unsigned char Tmin_num[2];//最低单体温度位置       Tmin_num[1]//最低单体温度位置：单体温度编号

extern unsigned char Vmax_box;//最高单体电压电池位置：电池箱编号
extern unsigned char Vmin_box;//最低单体电压电池位置：电池箱编号
extern unsigned char Tmax_box;//最高单体温度位置：温度箱箱号       
extern unsigned char Tmin_box;//最低单体温度位置：温度箱箱号 


//助力转向DC/A
extern unsigned int  YB_Wcurrent;
extern unsigned int  YB_Vcurrent;
extern unsigned int  YB_Ucurrent; 
extern unsigned char YB_temp;   //油泵散热温度
extern unsigned char YB_fault;  //油泵故障码

//传统空调
extern unsigned char KT_fault;
extern unsigned char KT_Status[2];
extern unsigned char KT_temp1;
extern unsigned char KT_temp2;
extern unsigned char KT_temp3;
extern unsigned char KT_comd;
extern unsigned char KT_life;
extern unsigned int BUZZ_COUNT;

extern DC_DATA  voltage_bat[10];    //单体电池电压
//BMS1只发送电压偏差最大的10个单体，正向5个，负向5个

extern DC_TEMP  temp_bat[10];//单体电池温度
//?BMS1只发送温度偏差最大的10个单体。
extern unsigned int Vspeed;

//油泵控制器
extern unsigned int  YB_voltage;
extern unsigned int  YB_current;  
extern unsigned char YB_temp;   //油泵散热温度
extern unsigned char YB_fault;  //油泵故障码
//转向助力泵（DC/AC） 空压机 气泵（DC/AC）电源
extern unsigned int  DCAC_speed[2];//电机估计转速
extern unsigned int  DCAC_current[2];//输出相电流
extern unsigned char DCAC_temp[2];//控制器温度
extern unsigned char DCAC_life[2];//控制器生命信号
extern unsigned char DCAC_Status[2];
extern unsigned char DCAC_fault[2];

extern unsigned int  DCDC_voltage;
extern unsigned int  DCDC_current;
extern unsigned char DCDC_fault;
//气泵控制器
extern unsigned int  QB_voltage_IN; 
extern unsigned int  QB_voltage_OUT;
extern unsigned int  QB_current;    
extern unsigned char QB_temp;        
extern unsigned char QB_fault;      
//灭火器
extern unsigned char MHQ_Number;
extern unsigned char MHQ_Alarm;
extern unsigned char MHQ_life;
extern unsigned char MHQ_fault;


/*****************分包处理CAN*****************/

